app/views/coordinators/enroll.html.slim

SELECT "enrollment_informations".* FROM "enrollment_informations" WHERE "enrollment_informations"."coordinator_id" = $1  [["coordinator_id", 3]]
---
      = ei.select  :registry_id, Registry.open.map{|r| [r.name, r.id]}, { prompt: 'Select Registry' }, { class: 'select2-input' }
      = ei.input   :method_of_contact, as: :select, collection: EnrollmentInformation::CONTACT_METHODS.map{|m| [m.to_s.titleize, m]}