app/views/coordinators/show.html.slim

      = @coordinator.name
  - @coordinator.enrollment_informations.each do |en_info|
    .row
      .col-sm-1
---
SELECT "enrollment_informations".* FROM "enrollment_informations" WHERE "enrollment_informations"."coordinator_id" = $1  [["coordinator_id", 3]]