app/views/participants/show.html.slim

SELECT "registries".* FROM "registries" INNER JOIN "enrollment_informations" ON "registries"."id" = "enrollment_informations"."registry_id" INNER JOIN "enrollment_participants" ON "enrollment_informations"."id" = "enrollment_participants"."enrollment_information_id" WHERE "enrollment_participants"."participant_id" = $1  [["participant_id", 5]]
---
    tbody
      - @participant.registries.each do |registry|