app/controllers/coordinators_controller.rb

  def enroll
    if request.get?
      @coordinator.enrollment_informations.build if @coordinator.enrollment_informations.blank?
---
SELECT "enrollment_informations".* FROM "enrollment_informations" WHERE "enrollment_informations"."coordinator_id" = $1  [["coordinator_id", 36]]

  def find_coordinator
    @coordinator = Coordinator.includes(enrollment_informations: [:registry, :participants]).find(params[:id])
---
SELECT "registries".* FROM "registries" WHERE "registries"."id" = $1  [["id", 11]]