app/controllers/registries_controller.rb

SELECT "registries".* FROM "registries" LIMIT $1 OFFSET $2  [["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "registries"
---
  def index
    @registries = Registry.all.page(params[:page]).per(params[:per] || 10)

UPDATE "registries" SET "status" = $1, "updated_at" = $2 WHERE "registries"."id" = $3  [["status", 0], ["updated_at", "2023-06-07 17:40:26.380679"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @registry.update(registry_params)

SELECT "registries".* FROM "registries" WHERE "registries"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def find_registry
    @registry = Registry.find(params[:id])